
# üß† ALX Academy Webinar: Subqueries, CTEs, and Views

Welcome everyone!  
In this session, we‚Äôll learn how to use **Subqueries**, **Common Table Expressions (CTEs)**, and **Views** in SQL using our `alx_academy` database.

We‚Äôll be using the `%%sql` magic command to run queries directly.

In [ ]:
!pip install ipython-sql pymysql --quiet
%load_ext sql

In [ ]:
%sql mysql+pymysql://root:lucky@localhost:3306/alx_academy

In [ ]:
%%sql
USE alx_academy;


## üß© 1. Subqueries (Queries inside queries)

Subqueries are like **questions inside other questions**.  
They help us get one piece of data and use it in another query.

### Example 1 ‚Äî Simple Subquery

In [ ]:

%%sql
SELECT student_id, course_id, exam
FROM marks
WHERE exam > (SELECT AVG(exam) FROM marks);

üó£Ô∏è *Explanation:* The inner query calculates the average exam score. The outer query selects all students who scored higher than that.

### Example 2 ‚Äî Subquery with `IN`

In [ ]:

%%sql
SELECT name, description
FROM course
WHERE instructor_id IN (
    SELECT instructor_id
    FROM instructor
    WHERE country IN ('Kenya', 'Ghana')
);

üó£Ô∏è *Explanation:* The inner query finds instructors from Kenya or Ghana. The outer query shows their courses.

### Example 3 ‚Äî Correlated Subquery

In [ ]:

%%sql
SELECT student_id, course_id, exam
FROM marks m1
WHERE exam > (
    SELECT AVG(exam)
    FROM marks m2
    WHERE m2.course_id = m1.course_id
);

üó£Ô∏è *Explanation:* This is a correlated subquery because the inner query depends on the outer query. We compare each student‚Äôs exam score to the average score for their course.


## üîÑ 2. Common Table Expressions (CTEs)

CTEs are **temporary result sets** that exist only while your query runs.  
They make long queries easier to read and reuse.

### Example 1 ‚Äî Basic CTE

In [ ]:

%%sql
WITH student_avg AS (
    SELECT student_id, AVG((test_1 + test_2 + exam) / 3) AS avg_score
    FROM marks
    GROUP BY student_id
)
SELECT s.first_name, s.last_name, student_avg.avg_score
FROM student_avg
JOIN students s ON s.student_id = student_avg.student_id;

üó£Ô∏è *Explanation:* The `WITH` clause creates a mini temporary table (`student_avg`) we can use in the main query.

### Example 2 ‚Äî CTE with Filtering

In [ ]:

%%sql
WITH student_avg AS (
    SELECT student_id, AVG((test_1 + test_2 + exam) / 3) AS avg_score
    FROM marks
    GROUP BY student_id
)
SELECT s.first_name, s.last_name, student_avg.avg_score
FROM student_avg
JOIN students s ON s.student_id = student_avg.student_id
WHERE student_avg.avg_score > 80;

üó£Ô∏è *Explanation:* We reuse the same CTE to filter students based on average score.

### Example 3 ‚Äî Recursive CTE

In [ ]:

%%sql
WITH RECURSIVE counter AS (
    SELECT 1 AS n
    UNION ALL
    SELECT n + 1 FROM counter WHERE n < 5
)
SELECT * FROM counter;

üó£Ô∏è *Explanation:* The first query starts at 1. The second query keeps adding 1 until it reaches 5.


## ü™û 3. Views

Views are **saved queries** ‚Äî like virtual tables.  
They don‚Äôt store data but make it easier to reuse logic.

### Example 1 ‚Äî Create a View

In [ ]:

%%sql
CREATE OR REPLACE VIEW student_instructor_view AS
SELECT s.first_name AS student_name,
       s.country AS student_country,
       i.first_name AS instructor_name,
       i.country AS instructor_country
FROM students s
JOIN instructor i ON s.instructor_id = i.instructor_id;

üó£Ô∏è *Explanation:* This creates a reusable ‚Äúvirtual table‚Äù combining students and instructors.

### Example 2 ‚Äî Query the View

In [ ]:

%%sql
SELECT * FROM student_instructor_view;

üó£Ô∏è *Explanation:* The view behaves like a table ‚Äî you can `SELECT` from it directly.

### Example 3 ‚Äî Drop the View

In [ ]:

%%sql
DROP VIEW IF EXISTS student_instructor_view;

üó£Ô∏è *Explanation:* Use this to clean up after your demo or recreate the view.

### üß© Lookup View

**Goal:** Create a lookup view to easily see which instructor teaches which course.

This is useful when we want quick access to instructor-course pairs without writing joins repeatedly.

In [ ]:
%%sql
CREATE OR REPLACE VIEW course_instructor_lookup AS
SELECT 
    c.course_id,
    c.name AS course_name,
    CONCAT(i.first_name, ' ', i.last_name) AS instructor_name
FROM course c
JOIN instructor i 
ON c.instructor_id = i.instructor_id;

In [ ]:
%%sql
-- Test the lookup view
SELECT * FROM course_instructor_lookup;

### üìä Aggregating View

**Goal:** Summarize how many courses each instructor teaches.**

We‚Äôll use `COUNT()` and `GROUP BY` to aggregate data into a summary view.

In [ ]:
%%sql
CREATE OR REPLACE VIEW instructor_course_summary AS
SELECT 
    i.instructor_id,
    CONCAT(i.first_name, ' ', i.last_name) AS instructor_name,
    COUNT(c.course_id) AS total_courses
FROM instructor i
LEFT JOIN course c 
ON i.instructor_id = c.instructor_id
GROUP BY i.instructor_id;

In [ ]:
%%sql
-- Test the aggregating view
SELECT * FROM instructor_course_summary;


## üèÅ Summary

- **Subqueries** let you use query results inside another query.  
- **CTEs** simplify complex queries and can even be recursive.  
- **Views** save and reuse query logic like virtual tables.